__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 512, 512, 1)  0
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 512, 32) 320         input_1[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 512, 512, 32) 0           conv2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 512, 512, 32) 128         activation_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 512, 512, 32) 9248        batch_normalization_1[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 512, 512, 32) 0           conv2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 512, 512, 32) 128         activation_2[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 256, 256, 32) 0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 256, 64) 18496       max_pooling2d_1[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 256, 256, 64) 0           conv2d_3[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 256, 256, 64) 256         activation_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 256, 256, 64) 36928       batch_normalization_3[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 256, 256, 64) 0           conv2d_4[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 256, 256, 64) 256         activation_4[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 128, 128, 64) 0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 128, 128 73856       max_pooling2d_2[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 128, 128, 128 0           conv2d_5[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 128, 128, 128 512         activation_5[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 128, 128 147584      batch_normalization_5[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 128, 128, 128 0           conv2d_6[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 128, 128, 128 512         activation_6[0][0]
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 64, 64, 128)  0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 64, 256)  295168      max_pooling2d_3[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 64, 64, 256)  0           conv2d_7[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 64, 64, 256)  1024        activation_7[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 64, 64, 256)  590080      batch_normalization_7[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 64, 64, 256)  0           conv2d_8[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64, 64, 256)  1024        activation_8[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 64, 64, 256)  0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 32, 32, 256)  0           dropout_1[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 512)  1180160     max_pooling2d_4[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 32, 32, 512)  0           conv2d_9[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 32, 32, 512)  2048        activation_9[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 512)  2359808     batch_normalization_9[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 32, 32, 512)  0           conv2d_10[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 32, 32, 512)  2048        activation_10[0][0]
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 32, 32, 512)  0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 16, 16, 512)  0           dropout_2[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 1024) 4719616     max_pooling2d_5[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 1024) 0           conv2d_11[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 16, 16, 1024) 4096        activation_11[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 1024) 9438208     batch_normalization_11[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 16, 1024) 0           conv2d_12[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 16, 1024) 4096        activation_12[0][0]
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 16, 16, 1024) 0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 32, 32, 512)  2097664     dropout_3[0][0]
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 32, 32, 512)  0           conv2d_transpose_1[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 32, 32, 512)  2048        activation_13[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 1024) 0           dropout_2[0][0]
                                                                 batch_normalization_13[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 32, 32, 512)  4719104     concatenate_1[0][0]
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 32, 32, 512)  0           conv2d_13[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 32, 32, 512)  2048        activation_14[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 32, 32, 512)  2359808     batch_normalization_14[0][0]
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 32, 32, 512)  0           conv2d_14[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 32, 32, 512)  2048        activation_15[0][0]
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 64, 64, 256)  524544      batch_normalization_15[0][0]
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 64, 64, 256)  0           conv2d_transpose_2[0][0]
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 64, 64, 256)  1024        activation_16[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64, 64, 512)  0           dropout_1[0][0]
                                                                 batch_normalization_16[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 64, 64, 256)  1179904     concatenate_2[0][0]
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 64, 64, 256)  0           conv2d_15[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 64, 64, 256)  1024        activation_17[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 64, 64, 256)  590080      batch_normalization_17[0][0]
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 64, 64, 256)  0           conv2d_16[0][0]
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 64, 64, 256)  1024        activation_18[0][0]
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 128, 128, 128 131200      batch_normalization_18[0][0]
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 128, 128, 128 0           conv2d_transpose_3[0][0]
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 128, 128, 128 512         activation_19[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 128, 128, 256 0           batch_normalization_6[0][0]
                                                                 batch_normalization_19[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 128, 128, 128 295040      concatenate_3[0][0]
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 128, 128, 128 0           conv2d_17[0][0]
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 128, 128, 128 512         activation_20[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 128, 128, 128 147584      batch_normalization_20[0][0]
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 128, 128, 128 0           conv2d_18[0][0]
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 128, 128, 128 512         activation_21[0][0]
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 256, 256, 64) 32832       batch_normalization_21[0][0]
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 256, 256, 64) 0           conv2d_transpose_4[0][0]
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 256, 256, 64) 256         activation_22[0][0]
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 256, 256, 128 0           batch_normalization_4[0][0]
                                                                 batch_normalization_22[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 256, 256, 64) 73792       concatenate_4[0][0]
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 256, 256, 64) 0           conv2d_19[0][0]
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 256, 256, 64) 256         activation_23[0][0]
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 256, 256, 64) 36928       batch_normalization_23[0][0]
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 256, 256, 64) 0           conv2d_20[0][0]
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 256, 256, 64) 256         activation_24[0][0]
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 512, 512, 32) 8224        batch_normalization_24[0][0]
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 512, 512, 32) 0           conv2d_transpose_5[0][0]
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 512, 512, 32) 128         activation_25[0][0]
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 512, 512, 64) 0           batch_normalization_2[0][0]
                                                                 batch_normalization_25[0][0]
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 512, 512, 32) 18464       concatenate_5[0][0]
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 512, 512, 32) 0           conv2d_21[0][0]
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 512, 512, 32) 128         activation_26[0][0]
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 512, 512, 32) 9248        batch_normalization_26[0][0]
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 512, 512, 32) 0           conv2d_22[0][0]
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 512, 512, 32) 128         activation_27[0][0]
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 512, 512, 1)  33          batch_normalization_27[0][0]
==================================================================================================